In [15]:
dict1={'names':['Ramesh','syresh','Mahesh',None],'Age':[20,21,None,22],'City':[None,'hyd','pune','berhampur']}
dict1

{'names': ['Ramesh', 'syresh', 'Mahesh', None],
 'Age': [20, 21, None, 22],
 'City': [None, 'hyd', 'pune', 'berhampur']}

In [17]:
import pandas as pd
import numpy as np

In [19]:
data=pd.DataFrame(dict1)
data

    names   Age       City
0  Ramesh  20.0       None
1  syresh  21.0        hyd
2  Mahesh   NaN       pune
3    None  22.0  berhampur

- while creating we provided None
- but by default the dataframe adjust the data type

In [21]:
data.to_csv('data1.csv',index=False)

In [23]:
import pandas as pd
import numpy as np
dict2={'names':['Ramesh','syresh','Mahesh',None],'Age':[20,21,None,22],'City':[None,'hyd','pune','berhampur']}
data1=pd.DataFrame(dict2)
data1

    names   Age       City
0  Ramesh  20.0       None
1  syresh  21.0        hyd
2  Mahesh   NaN       pune
3    None  22.0  berhampur

**fillna**

In [25]:
data.isnull()

   names    Age   City
0  False  False   True
1  False  False  False
2  False   True  False
3   True  False  False

In [15]:
data1.isnull().sum()

names    1
Age      1
City     1
dtype: int64

In [17]:
data1.fillna(30)

    names   Age       City
0  Ramesh  20.0         30
1  syresh  21.0        hyd
2  Mahesh  30.0       pune
3      30  22.0  berhampur

In [19]:

data1['names'].fillna('manish')

0    Ramesh
1    syresh
2    Mahesh
3    manish
Name: names, dtype: object

In [27]:
import warnings
warnings.filterwarnings('ignore')
data1.fillna(method='pad')

    names   Age       City
0  Ramesh  20.0       None
1  syresh  21.0        hyd
2  Mahesh  21.0       pune
3  Mahesh  22.0  berhampur

In [25]:
data1

    names   Age       City
0  Ramesh  20.0       None
1  syresh  21.0        hyd
2  Mahesh   NaN       pune
3    None  22.0  berhampur

In [27]:
data1.fillna(method='pad',axis=0)
#

    names   Age       City
0  Ramesh  20.0       None
1  syresh  21.0        hyd
2  Mahesh  21.0       pune
3  Mahesh  22.0  berhampur

In [29]:
data1.fillna(method='bfill',axis=0)
#

    names   Age       City
0  Ramesh  20.0        hyd
1  syresh  21.0        hyd
2  Mahesh  22.0       pune
3    None  22.0  berhampur

In [55]:
data1.fillna(method='ffill',axis=0)

    names   Age       City
0  Ramesh  20.0       None
1  syresh  21.0        hyd
2  Mahesh  21.0       pune
3  Mahesh  22.0  berhampur

In [33]:
data1.fillna(method='backfill',axis=0)

    names   Age       City
0  Ramesh  20.0        hyd
1  syresh  21.0        hyd
2  Mahesh  22.0       pune
3    None  22.0  berhampur

In [35]:
data1.fillna(method='pad',axis=1)

    names     Age       City
0  Ramesh    20.0       20.0
1  syresh    21.0        hyd
2  Mahesh  Mahesh       pune
3    None    22.0  berhampur

In [53]:
data1.fillna(method='bfill',axis=1)

    names   Age       City
0  Ramesh  20.0       None
1  syresh  21.0        hyd
2  Mahesh  pune       pune
3    22.0  22.0  berhampur

**mean-median-mode**

In [42]:
# first chose the column
# if it is numerical colum then fill with mean or median
# if it is categorical column then fill with mode
data1

    names   Age       City
0  Ramesh  20.0       None
1  syresh  21.0        hyd
2  Mahesh   NaN       pune
3    None  22.0  berhampur

In [51]:
mean_age=data['Age'].mean()
data1['Age'].fillna(mean_age)

0    20.0
1    21.0
2    21.0
3    22.0
Name: Age, dtype: float64

In [37]:
med_age=data['Age'].median()
data1['Age'].fillna(med_age)

0    20.0
1    21.0
2    21.0
3    22.0
Name: Age, dtype: float64

In [39]:
data1['City'].mode()

0    berhampur
1          hyd
2         pune
Name: City, dtype: object

In [43]:
import pandas as pd
import numpy as np
dict2={'names':['Ramesh','syresh','Mahesh',None],'Age':[20,21,None,22],'City':[None,'hyd','pune','berhampur']}
data2=pd.DataFrame(dict2)
data2

    names   Age       City
0  Ramesh  20.0       None
1  syresh  21.0        hyd
2  Mahesh   NaN       pune
3    None  22.0  berhampur

In [57]:
mode=data2['City'].mode()
data2['City'].fillna(mode)

0    berhampur
1          hyd
2         pune
3    berhampur
Name: City, dtype: object

In [61]:
mean_age

21.0

In [63]:
med_age

21.0

In [67]:
mode.values[0]
mode=data['City'].fillna(mode.values[0])
data2['City'].fillna(mode.values[0])
data2['City'].fillna(mode)

0    berhampur
1          hyd
2         pune
3    berhampur
Name: City, dtype: object

In [69]:
med_age=data['Age'].median()
data=['Age'].fillna(med_age)

AttributeError: 'list' object has no attribute 'fillna'

In [ ]:
mean=data[']

In [ ]:
from sklearn.impute import KNNImputer
knn=KNNImputer()